{
  "story": {
    "intro": "During a long road trip to visit your parents all the way in Manitoba, your car suddenly broke down in a remote area, with no cellphone service nor anyone nearby.\n You venture into a nearby forest searching for help. There you discover a spooky mansion and decide to enter in desperation,\n only to be immediately surrounded by zombies. In a state of panic you run into the attic for safety.\n Now, after catching your breath and realizing the horrific situation you've found yourself in, you must navigate through the rooms, defeat the zombies and find the key for your way out!",
    "escaped": "The key turns, and it unlocks. You shove it open and run out the door, using your flashlight to navigate through the midnight darkness of the woods. Sprinting back to your broken-down car by the highway,\n relief washes over you as you find police investigating the scene. You've been awake, alert and tired for so long and are too exhausted to explain the truth of what you experienced. The police assist with your car and ensure your safety,\ncasually dismissing your condition after they found amounts of strong psychedelics in your car. They don't bother conversating with you much,\nto which you don't mind. The next morning, clean and composed, you resume your drive to your parents' house,\nattempting to leave the nightmarish ordeal behind. However, the trauma lingers, etching a lasting mark on your psyche.\n\n**********THE END**********"
  },


  "game_over": [
    {
      "condition1": "health_zero",
      "message": "You have succumbed to your injuries. Remember, managing your health against zombies is crucial. Try to avoid unnecessary fights and consider smarter weapon choices."
    },
    {
      "condition2": "time_expired",
      "message": "You took too long to get out, and the toxic air finally overtook you. The lethal air within the forsaken walls of this zombie-infested house have claimed another victim, a fresh new zombie to inhabit its walls forever. As time slipped away, the poisonous atmosphere took its toll, sealing your fate.\nGame over. Remember: Time management is key; plan your moves carefully and keep an eye out for clues and shortcuts.",
      "turns": "X"
    }
  ],


    "rooms": [
    {
      "name": "attic",
      "first_text": "You are in the pitch-black attic, the only way out is down, the way you came.\nYou sense a fuse box, its outline faintly visible but powerless. You notice something small, smooth, and round on the floor beside the fuse box, resembling batteries, as well as what appears to be an axe. You realize the smart thing to do is to probably take both of them.",
      "TryingHallwayWithoutPower": "Power on the fuse box with the batteries first before going downstairs.",
      "after_text": "You are back in the attic. Looks cozy and safe, nice spot to catch your breath.",
      "times_entered": 1,
      "items": ["axe", "batteries"],
      "exits": ["hallway"],
      "zombies": 0
    },
    {
      "name": "hallway",
      "first_text": "You cautiously make your way down the ladder to the hallway, and there's two dull zombies on each end, west and east, blocking half open doors.\nThe only way into those two rooms will require you to kill them. Beside you, you see a bookshelf, empty except for a scribe with words and what appears to be some lockpicks.\nThe air quality is harsh and choking you, making you almost nauseous, and you realize you need to escape the house quickly before you slowly pass out and die.",
      "after_text": "You are in the hallway.",
      "WestorEastwithzombies": "The zombie is in the way! You'll have to kill the zombie first to go this way.",
      "times_entered": 0,
      "items": ["scribe", "lockpick"],
      "exits": ["bedroom", "office"],
      "zombies": 2
    },
    {
      "name": "bedroom",
      "first_text": "You open the door to find an old bedroom, filled with cobwebs and a thin layer of dust across the floor and furniture. Theres a menacing zombie standing and groaning on the bed;\n no one has slept in this bed in a while, and you doubt you would want to lay down on it either.\n The windows are too small for you to fit through, and too high up to jump out of. Nothing in this room looks interesting, except a bathroom to the north, as well as a locked rotary combination safe. What could be the passcode, and what could be inside?",
      "after_text": "You are in the bedroom.",
      "times_entered": 0,
      "items": ["gun"],
      "subrooms": ["safe"],
      "exits": ["hallway", "bathroom"],
      "zombies": 1
    },
    {
      "name": "Bathroom",
      "first_text_withoutriddle": "You find yourself in a run-down bathroom. The sink is stained, and a cracked mirror shows your worried face. At least there's no zombies here, but there are cockroaches and bugs. There is a bathtub but it's too disgusting to check out. Yuck! The only way out is south, the way you came.",
      "after_text": "You are in the Bathroom.",
      "times_entered": 0,
      "subrooms": ["bathtub"],
      "items": ["key"],
      "exits": ["bedroom"],
      "zombies": 0
    },
    {
      "name": "office",
      "first_text": "Looks like a super old fashioned office room. There's a locked door to go down to the first floor from here, but you'll need to find a key and lockpicks won't work. There's two more dangerous zombies in your way of getting to that door. The desk shelves are all open and empty, but one catches your eye;\n this shelf has a shiny handle, but it's loosely locked; can you open it with your lockpicks?",
      "after_text": "You are in the office room.",
      "times_entered": 0,
      "items": ["paper"],
      "subrooms": ["shelf"],
      "exits": ["hallway", "living room"],
      "zombies": 2
    },
    {
      "name": "living room",
      "first_text": "You made it downstairs to the living room! It's old fashioned with an old box TV and scattered DVD cassettes. Here's there's two more zombies in your of getting to the western foyer. There's nothing here, except a full bookshelf with an empty slot asking for 'Victor's Diary' to be placed on it to unlock passage to go down the basement.",
      "after_text": "You are in the living room.",
      "basementWithoutflashlight": "It's too dark and dangerous! Get a source of light first.",
      "times_entered": 0,
      "exits": ["basement", "office","foyer"],
      "zombies": 2
    },
    {
      "name": "kitchen",
      "first_text": "You enter the dirty kitchen. There's a zombie here, and a south exit to the garage, as well as a locked cupboard containing useful items. Continue your search for the front door key!",
      "after_text": "You are back in the kitchen, ready to cook & eat rotten zombies? Just kidding.",
      "times_entered": 0,
      "subrooms": ["cupboard"],
      "items": ["flashlight", "journal"],
      "exits": ["foyer","garage"],
      "zombies": 2
    },
    {
      "name": "garage",
      "first_text": "You enter the garage, an ugly dead end. Only thing here is a broken car like yours outside, and a zombie guarding an open box which contains what seems to be a diary. Try to retrieve the diary from the box!",
      "after_text": "You are back in the garage, smelling like grease. To cheer you up, at least your broken car outside is cooler than the one here.",
      "times_entered": 0,
      "subrooms": ["box"],
      "items": ["diary"],
      "exits": ["kitchen"],
      "zombies": 1
    },
    {
      "name": "foyer",
      "first_text": "You made it to the main foyer! It's very big and fancy, and there's 3 zombies here. There's a western exit to the kitchen, and the front door is heavily locked, requiring you to find a key to open it and exit as lockpicks won't work on it. Continue searching, maybe it's in the basement!",
      "after_text": "You are in the foyer.",
      "times_entered": 0,
      "items": [],
      "exits": ["kitchen", "living room", "Front Door"],
      "zombies": 3
    },
    {
      "name": "basement",
      "first_text": "You finally descend into the basement where you see in the far end 3 zombies guarding the front door key! There's no exits here neither anything interesting, besides the key. Kill the zombies to get the key!",
      "afterkillzombies": "You did it!! You killed all 3 zombies here, and the front door key is yours! you take a moment to catch your breath, the lingering adrenaline coursing through your veins. You make your way to the key as it rests on a gothic dried-blood-stained pedestal, next to a clothed human skeleton, bathed in moonlight filtering through a small window. A red tag attached to it declares hauntingly, 'Frontdoor key.'",
      "after_text": "You are back in the basement. Nothing to see here.",
      "times_entered": 0,
      "items": ["key"],
      "exits": ["living room"],
      "zombies": 3
    }
  ],

  "subrooms": [
    {
      "name": "shelf",
      "location": "office room",
      "locked": true,
      "items": "paper",
      "unlocker": "lockpick",
      "locked_message": "Looks like you'll need lockpicks; to open this.",
      "unlocked_message": "It opened! Inside you find a piece of paper with some numbers on it!",
      "openafter": "There's nothing in here anymore."
    },
    {
      "name": "safe",
      "location": "bedroom",
      "locked": true,
      "items": "gun",
      "unlocker": "paper",
      "locked_message": "This safe can't be unlocked by force nor by lockpicks as it has a rotary combination lock. Where can you find the code?",
      "unlocked_message": "The code from the paper worked! Inside you find a pistol, no way!",
      "openafter": "There's nothing in here anymore."
    },
    {
      "name": "bathtub",
      "location": "bathroom",
      "locked": true,
      "items": "key",
      "unlocker": "scribe",
      "openbathtub1": "Not trying to look in there, it's too disgusting!",
      "openbathtubwithriddle": "Despite the sheer disgust, you pull back the curtain and look into the bathtub and find a doorkey on the floor!",
      "openafter": "There's nothing in here anymore."
    },
    {
      "name": "box",
      "items": "diary",
      "unlocker": "paper",
      "location": "garage",
      "locked": true,
      "openbox": "A lone diary rests in here, could it be Victor's Diary?",
      "openafter": "There's nothing in here anymore."
    },
    {
       "name": "cupboard",
      "items": "gun",
      "unlocker": "lockpick",
      "location": "kitchen",
      "locked": true,
      "opencupboard1": "You'll need to use the lockpicks upstairs to unlock this.",
      "opencupboard2": "The lockpicks worked on the cupboard, and in it you find a flashlight and a journal! Both of these look promising.",
      "openafter": "Nothing in here anymore."
    }
  ],


  "items": [
    {
      "name": "batteries",
      "location": "attic",
      "desc": "Used to power on fuse box to power the house.",
      "TakenText": "These batteries look like they could work on the fuse box to give light to the house! Try them on the fuse box.",
      "PoweredOnFuseBoxmessage": "The batteries powered on the fuse box! You restore all power to the house, except for the basement which isn't working."
    },
    {
      "name": "axe",
      "location": "attic",
      "desc": "Jake's secondary defense against zombies.",
      "Damage": 28,
      "TakenText": "This will be really helpful to fight off all the zombies downstairs. Maybe there's more weapons in the house?"
    },
    {
      "name": "scribe",
      "location": "hallway",
      "desc": "Riddle for clue needed to find key to downstairs key in office.",
      "TakenText": "This scrap of paper has a little riddle written on it in cursive handwriting. It reads:\n'I'm not a lock, but a tool that turns,\nIn the bathroom, where cleanliness yearns.\nNear the basin or tub, where water flows free,\nSearch for me there, and the key you shall see.'"
    },
    {
      "name": "lockpick",
      "location": "hallway",
      "desc": "Useful tool needed to unlock various things.",
      "TakenText": "A handy lockpick set! Back in high school you had a set just like this and were a pro at lockpicking. This can definitely unlock some cool things throughout this house."
    },

    {
      "name": "flashlight",
      "location": "cupboard",
      "desc": "Required to navigate the dark basement.",
      "TakenText": "You grab the flashlight and it works! You can use this to access the dark mysterious basement where there's no light."
    },
    {
      "name": "gun",
      "location": "safe",
      "desc": "A pistol, this could do serious damage.",
      "Damage": 50,
      "TakenText": "This pistol looks like it was made 100 years ago. Nonetheless, it will make it easier to kill zombies, but you notice it only has 15 bullets left, so use wisely.",
      "BulletsLeft": 15
    },
    {
      "name": "paper",
      "location": "office",
      "desc": "Passcode for a safe.",
      "TakenText": "Seems like a 5 digit numerical code for a safe. Wonder where the safe is, and what could lie inside of it?"
    },
    {
      "name": "key",
      "location": "bathtub",
      "desc": "Unlocks downstairs door in office.",
      "TakenText": "What was this key doing in this nasty bathtub? Nonetheless, let's go to the office and use it to unlock the key to downstairs."
    },
    {
      "name": "escapekey",
      "location": "basement",
      "desc": "Unlock the front door for escape.",
      "TakenText": "Taken! Finally, let's use this key to escape the house from the foyer."
    },
    {
      "name": "journal",
      "location": "cupboard",
      "desc": "Explanation for everything going on.",
      "TakenText": "A small journal! It seems handmade in a rush, with a hard leather cover and only two pages inside, held together with strings. What could it contain? Read it to find out. Time is running out!",
      "UseJournal": "The small yet concise journal reads:\n\tDear my beloved Seraphina,\n\t\tIt is I, your dear husband of 30 years, Victor Blackthorne. I am grieved of your passing and want to raise you from the dead so that we may live together once again. I am locking\n this journal away in the kitchen and hope you will find it, as you always found me in my lows and helped me. I am composing this final letter in case you come back but I am longer here.\n My quest for forbidden knowledge has found me digging up the dead from the cemetery and experimenting on them in our basement, in hopes to be able to raise you too, my love. But the undead are overpowering me and not listening to my commands and I\n fear my death is certain, and I will never be able to see you again nor be buried with you. If you ever do come back, my diary in the garage written in our secret language has instructions on this forbidden disgraced knowledge\n so that you may bring me back too. I have hidden a gun in our safe, the passcode locked in the office desk shelf, and have locked all doors and windows to prevent the zombies from escaping outside, as well as powered off the house.\n Place my diary on the bookshelf in the living room to come find me, as I will spend my final moments hiding in the basement before the zombies get to me. I have with me the front door key, the only way out this nightmare.\n Retrieve it from the basement, unlock the front door, and release these malevolent beings once and for all. There remains no more barriers to overcome; the world must bear the consequences of my anguish and suffering\n in my innocent pursuit of tranquility and repose to have my wife back. Our suffering is ceaseless and harrowing, and I harbor no hopes for a better world for anyone except for us both. \nThis infernal punishment persists in its deceit, offering no deeper understanding of myself or the existence that surrounds me.\n"
    },
    {
      "name": "diary",
      "location": "box",
      "desc": "To get to the basement.",
      "TakenText": "You take a well maintained black hardcover diary with just two eerie words on its cover, reading 'Victor's Diary'.",
      "UseDiaryinLivingroom": "Using the diary on shelf causes the bookshelf to slide down and reveal the stairs to basement, where you're potential escape awaits! It's too dark down there, and you'll need a source of light to go.",
      "UseDiaryElsewhere": "This diary is old and the handwriting looks unreadable. The only use you have for it would be to try using it on the living room bookshelf."
    }
  ],
   "player": {"name": "Jake", "health": 200
  },
  "npcs": [
    {
      "type": "zombie",
      "health": 60,
      "damage_min": 15,
      "damage_max": 40,
      "is_friendly": false
    },
    {
      "type": "friendly zombie",
      "health": 35,
      "is_friendly": true,
      "shout": "geghfbeubsbdeg"
    }
  ],


  "weapons": {
    "gun": {
      "name": "gun",
      "attack_message": "Headshot, the zombie is dead",
      "damage_message": "Zombie health -= 35",
      "is_wielded": false
    },
    "axe": {
      "name": "axe",
      "attack_message": "Bodyshot, the zombie is injured",
      "damage_message": "Zombie health -= 20 to 35 damage",
      "kill_message": "Lucky, your axe killed the zombie",
      "kill_damage": "Zombie health -= 20 to 35 damage (If it kills)",
      "is_wielded": false
  }
},

    "verbs":  ["open", "take", "use", "wield", "attack", "inventory"]

}