{
  "rooms": [
    {
      "name": "Attic",
      "first_text": "You are in the pitch-black attic, navigating through musty darkness. The only sound is your cautious steps on creaking floorboards. Ghostly shapes of trunks and forgotten items emerge in the dimness. Cobwebs cling to unseen rafters, weaving a web of mystery.\nIn the darkness, you sense a fuse box, its outline faintly visible but powerless. The idea of fumbling through the dark to restore power sends shivers down your spine. This forgotten space is isolated and unknown, heightened by an eerie silence broken only by your soft movements. You only wish you could find something on the floor to see what’s going on. You notice something small, smooth, and round on the floor beside the fuse box. What could it be?\n",
      "after_text": "You are back in the attic.",
      "times_entered": 0,
      "items": ["axe", "batteries"],
      "exits": ["Hallway"],
      "zombies": 2
    },
    {
      "name": "Hallway",
      "first_text": "You are standing in a wide hallway leading to a closed room –– you do not know what is behind the door. After searching the room, you notice a small ripped piece of paper on the floor with what appears to be written scribbles. You also hear a sharp creek behind you. Upon investigating the sound, you discover the sound came from a creaking cupboard opening behind you. You will need to get from the hallway to the next room.",
      "after_text": "You are in the Hallway.",
      "times_entered": 0,
      "items": ["riddle", "lockpick"],
      "exits": ["Bedroom", "Office Room", "Bathroom", "Living Room"],
      "zombies": 3
    },
    {
      "name": "Bedroom",
      "first_text": "You open the door to find an old bedroom, filled with cobwebs and a thin layer of dust across the floor and furniture. No one has slept in this bed in a while, and you doubt you would want to lay down on it either. \nYou currently see a large bed in the middle of the room, supplemented by a nightstand with a drawer and a dimly lit lamp. There is also a giant antique closet in the corner of the room.\n",
      "after_text": "You are in the Bedroom.",
      "times_entered": 0,
      "items": ["pistol"],
      "exits": ["Hallway"],
      "zombies": 1
    },
    {
      "name": "Bathroom",
      "first_text": "You find yourself in a run-down bathroom. The sink is stained, and a cracked mirror shows your worried face. The riddle from the hallway comes to mind. Could it lead to a weapon or key? Either can help.",
      "after_text": "You are in the Bathroom.",
      "times_entered": 0,
      "items": ["Key for stairs between Office Room and Living Room"],
      "exits": ["Hallway"],
      "zombies": 0
    },
    {
      "name": "Office Room",
      "first_text": "You peek into a white room, one that lacks a doorway and what appears to be a spot where a doorway should be. It appears to be a room where the person who previously lived here worked. You see a sole table at the end of the room next to the wall. Upon it is a typewriter. On another side of the wall are the markings of a doorway, but no door.",
      "after_text": "You are in the Office Room.",
      "times_entered": 0,
      "items": ["Gun Safe Passcode Paper"],
      "exits": ["Hallway", "Living Room"],
      "zombies": 2
    },
    {
      "name": "Living Room",
      "first_text": "You enter a large room with media entertainment and a large couch and sofa. The rug seems to be dusty and oddly void of any signs of human interaction. There are spider webs on the couch, and the television screen holds a thick layer of dust. As you wander through the living room, you pick up multiple objects searching under them in hopes of finding a clue to help you escape the mansion and get to safety.",
      "after_text": "You are in the Living Room.",
      "times_entered": 0,
      "items": ["Victor’s Diary"],
      "exits": ["Hallway", "Basement", "Office Room"],
      "zombies": 3
    },
    {
      "name": "Kitchen",
      "first_text": "You find yourself in a dimly lit kitchen, with faded wallpaper peeling off the walls. Dusty countertops and old appliances tell a story of neglect. It's clear that this room holds secrets waiting to be discovered behind its locked cupboards. As you explore, don't forget to thoroughly search for items that might aid your escape.",
      "after_text": "You are in the Kitchen.",
      "times_entered": 0,
      "items": ["flashlight", "Small Journal"],
      "exits": ["Foyer"],
      "zombies": 2
    },
    {
      "name": "Garage",
      "first_text": "You Enter the garage, a broken-down car occupies a corner, its once-vibrant color now faded. The air is thick with the scent of oil and memories. Dim light filters through dusty windows, revealing a space frozen in time. A neglected workbench and scattered tools tell tales of abandonment. Amidst the silence, a dusty corner holds a secret—a cardboard box, promising hidden stories from the past.",
      "after_text": "You are in the Garage.",
      "times_entered": 0,
      "items": ["Victor’s Diary"],
      "exits": ["Kitchen"],
      "zombies": 1
    },
    {
      "name": "Foyer",
      "first_text": "You enter the foyer. It feels like crossing a threshold into an unsettling elegance. The polished tiles underfoot seem to reflect shadows that dance with an eerie rhythm, and the grand staircase, while elegant, exudes a subtle foreboding. Vintage artwork on the walls stares back with eyes that seem to follow your every move. The front door, a formidable barrier between the foyer and the outside world, appears almost supernaturally resilient. Crafted from a dense, seemingly impenetrable oak, its surface bears no signs of wear or vulnerability. The wood, stained to a deep, foreboding hue, stands as a silent guardian, immune to the passage of time.",
      "after_text": "You are in the Foyer.",
      "times_entered": 0,
      "items": [],
      "exits": ["Kitchen", "Living Room"],
      "zombies": 4
    },
    {
      "name": "Basement",
      "first_text": "You descend into the basement, and impenetrable darkness engulfs you, rendering your surroundings invisible. The air feels thick and cool, and the silence is absolute. As you cautiously move forward, your outstretched hands meet only the void. You decide you won’t go there without being able to see. You head back to the living room.",
      "after_text": "You are in the Basement.",
      "times_entered": 0,
      "items": ["front door key"],
      "exits": ["Living Room"],
      "zombies": 4
    }
  ],
  "player": {
    "name": "Jake",
    "age": 25,
    "health": 200
  },
  "npcs": [
    {
      "type": "zombie",
      "health": 35,
      "damage_min": 15,
      "damage_max": 40,
      "is_friendly": false
    },
    {
      "type": "friendly zombie",
      "health": 35,
      "is_friendly": true,
      "shout": "geghfbeubsbdeg"
    }
  ],
  "weapons": {
    "Gun": {
      "message": "Headshot, the zombie is dead",
      "Damage": "Zombie health -= 35"
    },
    "Axe": {
      "message1": "Bodyshot, the zombie is injured",
      "Damage1": "Zombie health -= 20 to 35 damage",
      "message2": "Lucky, your axe killed the zombie",
      "Damage2": "Zombie health -= 20 to 35 damage (If it kills)"
    },
    "ZombieAttack": {
      "message": "Ow, that hurt, the zombie did X damage, you now have X health left",
      "UserHealth": "User health -= X damage"
    }
  },
  "story": {
    "intro": "During a long road trip to visit your parents, your car suddenly broke down in a remote area, with no cellphone or someone nearby, you ventured into a nearby forest searching for help. There you discover a spooky mansion and decide to enter in desperation, only to be immediately surrounded by zombies. In a state of panic you ran into the attic for safety. Now, armed with weapons and items found in the mansion you must navigate through the rooms, defeat the zombies and find the key for your way out !",
    "epilogue": "Once he escapes, he finally sees real people who help him. He eventually makes it to his parent's home.",
    "end": "Congratulations! After a harrowing journey through the eerie mansion, solving puzzles, defeating zombies, and piecing together the clues, you've managed to find the Front Door Key. With trembling hands, you unlock the front door and step out into the cool night air, leaving the horrors of the mansion behind."
  },
  "game_over": [
    {
      "condition": "health_over",
      "message": "You have succumbed to your injuries. Remember, managing your health against zombies is crucial. Try to avoid unnecessary fights and find health items."
    },
    {
      "condition": "time_expired",
      "message": "Time has run out before you could escape. Time management is key; plan your moves carefully and keep an eye out for shortcuts.",
      "turns": "X"
    },
    {
      "condition": "caught",
      "message": "You were overwhelmed by zombies. Sometimes, stealth is smarter than confrontation. Consider using silent weapons or finding paths around them."
    }
  ]

}

